Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/travel/bus_and_coach_passenger_rights_in_the_european_union.html.txt.tmx
Source language: en
Languages: ga

source: If you are dissatisfied with an Irish carrier’s decision and your rights under the Regulation have been denied, or you did not receive a reply within 1 month of making the complaint, you can make a complaint to the National Transport Authority
ga: Mura bhfuil tú sásta le cinneadh iompróra Éireannaigh agus má sáraíodh do chearta faoin Rialachán, nó mura bhfuair tú freagairt laistigh de mhí amháin tar éis gearán a dhéanamh, féadfaidh tú gearán a dhéanamh leis an Údarás Náisiúnta Iompair

source: Information on making a complaint is available on its website
ga: Tá faisnéis ar fáil ar ghearán a dhéanamh ar a láithreán gréasáin
